org/algebra-lineal.org
#+title: Álgebra Lineal
# the title seems to have no effect
#+OPTIONS: TeX:t tags:nil toc:nil num:nil
# Export tex symbols
# Don't export tags
# Don't create a table of contents
# Export without section numbers

# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style1.css" />

* Sobre el curso de álgebra lineal
** Datos

- Aula :: MF-5 del edificio MF-3.
- Instructor :: Dr. Rafael Villarroel
- Oficina :: 14 del edificio MF-1
- Correo electrónico :: =rafaelv@uaeh.edu.mx= 

** Introducción

Existen al menos dos maneras de impartir un curso de álgebra
lineal. La mayor parte de los libros inician con sistemas de
ecuaciones lineales y después abstraen a partir de allí los conceptos
de espacio vectorial y subespacios. Por lo regular, se concentran
únicamente en los campos de los números reales y de los números
complejos. 

El presente curso utiliza un enfoque diferente, el cual pienso que es
provechoso para alumnos de las licenciaturas de matemáticas y
física. Desde el principio se enfatiza el método axiomático y
deductivo, es decir, las definiciones, los ejemplos y las
demostraciones de los teoremas.

** Temario

*** Espacios vectoriales
    - Campos 
    - Definición y ejemplos de espacios vectoriales 
    - Propiedades elementales de los espacios vectoriales
*** Subespacios
    - Definición y ejemplos
    - Teoremas sobre subespacios
    - Sistemas de ecuaciones lineales
    - Combinaciones lineales
*** Independencia lineal
    - Definición
    - Bases y dimensión
*** Transformaciones lineales
     - Definición y ejemplos
     - El núcleo (/kernel/) y la imagen
     - La matriz asociada
     - Multiplicación de matrices
     - Invertibilidad e isomorfismos
     - La matriz de cambio de coordenadas
     - Aspectos teóricos  sistemas de ecuaciones lineales

** Evaluación del curso

Se efectuarán tres evaluaciones del curso, cada evaluación consta de
un "preexamen" y un examen. Cada preexamen vale \(\frac{1}{12}\) y cada
examen vale \(\frac{1}{4}\) de la calificación final.

*** Fechas de exámenes:

- Primer preexamen: 
- Primer examen: 
- Segundo preexamen: 
- Segundo examen: 
- Tercer preexamen: 
- Tercer examen: 

** Bibliografía recomendada
* Campos                                                               :blog:

  :PROPERTIES:
  :CATEGORY: 2013cAlgebraLineal
  :ON: <2013-07-26 Fri>
  :categories: campos axiomas
  :comments: true
  :END:

** Definición y ejemplos

#+begin_definition
Un /campo/ \(F\) es un conjunto junto con dos operaciones binarias, una
suma \(+\colon F\times F\to F\) y un producto \(\cdot\colon F\times
F\to F\) tales que:
- F1 :: La suma es /conmutativa/, es decir \(a+b=b+a\) para todos
        \(a,b\in F\).
- F2 :: La suma es asociativa.
- F3 :: Existe un elemento \(0\in F\) tal que \(a+0=0+a=a\) para todo
        \(a\in F\). El elemento \(0\) se llama /elemento neutro/ de la
        suma. 
- F4 :: Para todo elemento \(a\in F\), existe un elemento \(-a\in F\)
        tal que \(a+(-a)=(-a)+a=0\). El elemento \(-a\) se llama
        /inverso aditivo/ de \(a\).
- F5 :: El producto es conmutativo.
- F6 :: El producto es asociativo.
- F7 :: Existe un elemento \(1\in F\) tal que \(a1=1a=a\) para todo
        \(a\in F\). Además \(1\ne 0\)
- F8 :: Para todo elemento \(a\in F\), tal que \(a\ne 0\) existe un
        elemento \(a^{-1}\in F\) tal que \(a(a^{-1})=(a^{-1})a=1\).
- F9 :: Para todos los elementos \(a,b,c\in F\) se tiene que
        \(a(b+c)=ab+ac\) y que \((a+b)c=ac+bc\).
#+end_definition

Como ejemplos de campos, tenemos:

- El conjunto \(\mathbb{R}\) de los números reales, con las
  operaciones usuales, es un campo.

#+begin_theorem
Solo para checar...
#+end_theorem
