org/algebra-lineal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Álgebra Lineal</title>
<!-- 2013-07-27 Sat 13:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<link rel="stylesheet" type="text/css" href="style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">Álgebra Lineal</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Sobre el curso de álgebra lineal</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Datos</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt> Aula </dt><dd>MF-5 del edificio MF-3.
</dd>
<dt> Instructor </dt><dd>Dr. Rafael Villarroel
</dd>
<dt> Oficina </dt><dd>14 del edificio MF-1
</dd>
<dt> Correo electrónico </dt><dd><code>rafaelv@uaeh.edu.mx</code> 
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Introducción</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Existen al menos dos maneras de impartir un curso de álgebra
lineal. La mayor parte de los libros inician con sistemas de
ecuaciones lineales y después abstraen a partir de allí los conceptos
de espacio vectorial y subespacios. Por lo regular, se concentran
únicamente en los campos de los números reales y de los números
complejos. 
</p>

<p>
El presente curso utiliza un enfoque diferente, el cual pienso que es
provechoso para alumnos de las licenciaturas de matemáticas y
física. Desde el principio se enfatiza el método axiomático y
deductivo, es decir, las definiciones, los ejemplos y las
demostraciones de los teoremas.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Temario</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Espacios vectoriales</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Campos 
</li>
<li>Definición y ejemplos de espacios vectoriales 
</li>
<li>Propiedades elementales de los espacios vectoriales
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Subespacios</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Definición y ejemplos
</li>
<li>Teoremas sobre subespacios
</li>
<li>Sistemas de ecuaciones lineales
</li>
<li>Combinaciones lineales
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">Independencia lineal</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>Definición
</li>
<li>Bases y dimensión
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4">Transformaciones lineales</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>Definición y ejemplos
</li>
<li>El núcleo (<i>kernel</i>) y la imagen
</li>
<li>La matriz asociada
</li>
<li>Multiplicación de matrices
</li>
<li>Invertibilidad e isomorfismos
</li>
<li>La matriz de cambio de coordenadas
</li>
<li>Aspectos teóricos  sistemas de ecuaciones lineales
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Evaluación del curso</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Se efectuarán tres evaluaciones del curso, cada evaluación consta de
un "preexamen" y un examen. Cada preexamen vale \(\frac{1}{12}\) y cada
examen vale \(\frac{1}{4}\) de la calificación final.
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Fechas de exámenes:</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Primer preexamen: 
</li>
<li>Primer examen: 
</li>
<li>Segundo preexamen: 
</li>
<li>Segundo examen: 
</li>
<li>Tercer preexamen: 
</li>
<li>Tercer examen: 
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Bibliografía recomendada</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Campos</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Definición y ejemplos</h3>
<div class="outline-text-3" id="text-2-1">
<div class="definition">
<p>
Un <i>campo</i> \(F\) es un conjunto junto con dos operaciones binarias, una
suma \(+\colon F\times F\to F\) y un producto \(\cdot\colon F\times
F\to F\) tales que:
</p>
<dl class="org-dl">
<dt> F1 </dt><dd>La suma es <i>conmutativa</i>, es decir \(a+b=b+a\) para todos
        \(a,b\in F\).
</dd>
<dt> F2 </dt><dd>La suma es asociativa.
</dd>
<dt> F3 </dt><dd>Existe un elemento \(0\in F\) tal que \(a+0=0+a=a\) para todo
\(a\in F\). El elemento \(0\) se llama <i>elemento neutro</i> de la
suma. 
</dd>
<dt> F4 </dt><dd>Para todo elemento \(a\in F\), existe un elemento \(-a\in F\)
tal que \(a+(-a)=(-a)+a=0\). El elemento \(-a\) se llama
<i>inverso aditivo</i> de \(a\).
</dd>
<dt> F5 </dt><dd>El producto es conmutativo.
</dd>
<dt> F6 </dt><dd>El producto es asociativo.
</dd>
<dt> F7 </dt><dd>Existe un elemento \(1\in F\) tal que \(a1=1a=a\) para todo
        \(a\in F\). Además \(1\ne 0\)
</dd>
<dt> F8 </dt><dd>Para todo elemento \(a\in F\), tal que \(a\ne 0\) existe un
elemento \(a^{-1}\in F\) tal que \(a(a^{-1})=(a^{-1})a=1\).
</dd>
<dt> F9 </dt><dd>Para todos los elementos \(a,b,c\in F\) se tiene que
        \(a(b+c)=ab+ac\) y que \((a+b)c=ac+bc\).
</dd>
</dl>

</div>

<p>
Como ejemplos de campos, tenemos:
</p>

<ul class="org-ul">
<li>El conjunto \(\mathbb{R}\) de los números reales, con las
operaciones usuales, es un campo.
</li>
</ul>

<div class="theorem">
<p>
Solo para checar&#x2026;
</p>

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rafael Villarroel</p>
<p class="date">Created: 2013-07-27 Sat 13:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
